---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.EffectInstance
source: html/3764dc90-654d-92e3-02b1-de0eaf8f9b77.htm
---
# EffectInstance Methods

Tests whether the effect instance is valid for rendering.